cyrylica={
'А':'A', 'a': 'a',
 'Б'= 'B', 'b':'б',
 'В':'W', 'в':'w',
 'Г':'H', 'г':'h',
 'Д':'D', 'д':'d',
 'Е':'Je', 'е':'je',
 'Ё':'Jo', 'ё':'jo',
 'Ж':'Ż', 'ж':'ż',
 'З':'Z', 'з':'z',
 'И':'I', 'и':'i',
 'Й':'J', 'й':'j',
 'К':'K', 'к':'k',
 'Л':'L', 'л':'l',
 'М':'M', 'м':'m',
 'Н':'N', 'н':'n',
 'О':'O', 'о':'o',
 'П':'P', 'п':'p',
 'Р':'R', 'р':'r',
 'С':'S', 'с':'s',
 'Т':'T', 'т':'t',
 'У':'U', 'у':'u',
 'Ф':'F', 'ф':'f',
 'Х':'Ch', 'х':'ch',
 'Ц':'C', 'ц':'c',
 'Ч':'Cz', 'ч':'cz',
 'Ш':'Sz', 'ш':'sz',
 'Щ':'Szcz', 'щ':'szcz',
 'Ъ':'', 'ъ':'',
 'Ы':'Y',  'ы':'y',
 'Ь':'', 'ь':'',
 'Э':'E', 'э':'e',
 'Ю':'Ju', 'ю':'ju',
 'Я':'Ja', 'я':'ja',
 '\n':'\n'}

def zamien(tekst):
    t = tekst.split()
    transkrypt=[]
    for a in t:
        c = t(a)
        transkryptcyrylica['c']

tekst = str(input())

